{
    "@context": [
        "http://localhost:4000/hydra/@context/video.jsonld",
        {
            "@base": "http://localhost:4000"
        }
    ],
    "@type": [
        "http://videos.resftest.org/api/Video",
        "http://schema.org/VideoObject"
    ],
    "name": "REST Fest 2012 \\ Matt Bishop",
    "description": "TITLE: HATEOAS Your Cake and Eat It Too: Turning Complex Business Processes into an Easy-To-Use API\n\nDESCRIPTION: We set out to build a HATEOAS server that had all the bells and whistles, only to find, well, not many pre-existing bells and whistles. By necessity we had to build our own HATEOAS server and figure out how to turn our complex e-commerce process into an API that required little training to succeed with. This talk will cover that journey and give some insight as to how to do it yourself.\n\nPRESENTER: Matt Bishop is the Senior Product Architect at Elastic Path (EP). He and the dev team at EP have been busy for the last 18 months building out a Level 3 REST (HATEOAS) API for their high-end ecommerce system. Before that Matt was an Innovation Architect at SAP researching REST, trying to find a way to move SAP from SOAP to REST (failed) he also researched Comet and mobile applications. Before that was a stint working on mobile apps in the technical service industry (lots of mud, dust and toxic waste). Before that Matt worked at BEA on Weblogic Workshop 7 and 8 (Eclipse sucked back then too). Before that he developed software to print magazines and newspapers which is way more interesting that it sounds. There's a few other before-thats, including Atari Computers (not the games). Matt has been building Internet apps (hello Server-Side Applets!) since when people thought AOL was the Internet and the cool kids had shotgunned dialup.",
    "duration": 2702,
    "width": 640,
    "height": 360,
    "embed": {
        "html": "<iframe src=\"https://player.vimeo.com/video/49609648?title=0&byline=0&portrait=0&badge=0&autopause=0&player_id=0&app_id=135039\" width=\"640\" height=\"360\" frameborder=\"0\" title=\"REST Fest 2012 \\ Matt Bishop\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>",
        "badges": {
            "hdr": false,
            "live": {
                "streaming": false,
                "archived": false
            },
            "staff_pick": {
                "normal": false,
                "best_of_the_month": false,
                "best_of_the_year": false,
                "premiere": false
            },
            "vod": false,
            "weekend_challenge": false
        }
    },
    "created_time": "2012-09-17T15:51:47+00:00",
    "modified_time": "2017-10-24T03:24:53+00:00",
    "release_time": "2012-09-17T15:51:47+00:00",
    "license": "by-nc-sa",
    "@id": "/videos/hydra/49609648.jsonld"
}
